app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def show
    @posts = Post.all