app/controllers/posts_controller.rb

  def index
    @posts = Post.posts_by(current_user).page(params[:page]).per(15)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("date", "rationale", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", Wed, 23 Nov 2016], ["rationale", "This is a new admin entry"], ["created_at", 2016-11-23 16:59:37 UTC], ["updated_at", 2016-11-23 16:59:37 UTC], ["user_id", 2], ["status", 1]]

  def update
    authorize @post
    if @post.update(post_params)
---
UPDATE "posts" SET "rationale" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["rationale", "2 rationale content yoyoyo"], ["updated_at", 2016-11-22 12:03:09 UTC], ["id", 3]]

  def destroy
    @post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 9]]